***Feature Scaling is a technique to standardize the independent features present in the data in a fixed range. It is performed during the data pre-processing to handle highly varying magnitudes or values or units.***

<img src='scaling.png' height="600" width="550">

In [1]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [2]:
data_set = pd.read_csv('feature scaling.csv')
data_set.head()

   Country  Age  Salary Purchased
0   France   44   72000        No
1    Spain   27   48000       Yes
2  Germany   30   54000        No
3    Spain   38   61000        No
4  Germany   40   70000       Yes

In [3]:
#x = data_set[['Age', 'Salary']]
x = data_set.iloc[:, 1:3]  #[row,column]
x.head()

   Age  Salary
0   44   72000
1   27   48000
2   30   54000
3   38   61000
4   40   70000

<h1 style=color:green> MinMax Scaler (Normalization)</h1>

<h3 style=color:red>Formula:</h3>

<img src='MinMax.png' height="500" width="450">

In [4]:
from sklearn.preprocessing import MinMaxScaler
MinSca = MinMaxScaler()

scale_MinMax = MinSca.fit_transform(x)
scale_MinMax

array([[0.73913043, 0.68571429],
       [0.        , 0.        ],
       [0.13043478, 0.17142857],
       [0.47826087, 0.37142857],
       [0.56521739, 0.62857143],
       [0.34782609, 0.28571429],
       [0.17391304, 0.11428571],
       [0.91304348, 0.88571429],
       [1.        , 1.        ],
       [0.43478261, 0.54285714]])

In [5]:
sc = pd.DataFrame(scale_MinMax,columns=['Age','Salary'])
sc.head()

        Age    Salary
0  0.739130  0.685714
1  0.000000  0.000000
2  0.130435  0.171429
3  0.478261  0.371429
4  0.565217  0.628571

In [6]:
data_set.drop(['Age','Salary'],axis=1,inplace=True)

In [28]:
data_set.head()

   Country Purchased
0   France        No
1    Spain       Yes
2  Germany        No
3    Spain        No
4  Germany       Yes

In [29]:
data_set = pd.concat([data_set,sc],axis=1)
data_set.head()

   Country Purchased       Age    Salary
0   France        No  0.739130  0.685714
1    Spain       Yes  0.000000  0.000000
2  Germany        No  0.130435  0.171429
3    Spain        No  0.478261  0.371429
4  Germany       Yes  0.565217  0.628571

In [32]:
new_col = ['Country', 'Age', 'Salary', 'Purchased'] #Swap Column position

data_set = data_set.reindex(columns=new_col) 
data_set.head()

   Country       Age    Salary Purchased
0   France  0.739130  0.685714        No
1    Spain  0.000000  0.000000       Yes
2  Germany  0.130435  0.171429        No
3    Spain  0.478261  0.371429        No
4  Germany  0.565217  0.628571       Yes

<h1 style=color:green>Z-Score Scaling (Standardization)</h1>

<h3 style=color:red>Formula:</h3>

<img src='Stand.jpg' height="500" width="450">

In [33]:
from sklearn.preprocessing import StandardScaler
StaSca = StandardScaler()

scale_Stander = StaSca.fit_transform(x)
scale_Stander

array([[ 0.82572282,  0.6829409 ],
       [-1.51382518, -1.47371457],
       [-1.10096377, -0.9345507 ],
       [ 0.        , -0.30552619],
       [ 0.27524094,  0.50321961],
       [-0.41286141, -0.57510812],
       [-0.96334329, -1.11427199],
       [ 1.37620471,  1.31196541],
       [ 1.65144565,  1.67140798],
       [-0.13762047,  0.23363768]])

In [ ]:
sc = pd.DataFrame(scale_Stander,columns=['Age','Salary'])
sc.head()

In [ ]:
data_set.drop(['Age','Salary'],axis=1,inplace=True)

In [ ]:
data_set.head()